---
type: Leader
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# Leader

`Autodesk.Revit.DB.Leader` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Anchor | 2016 | `public XYZ Anchor { get ; }` |
| Property | Elbow | — | `public XYZ Elbow { get ; set ; }` |
| Property | End | — | `public XYZ End { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LeaderShape | 2016 | `public LeaderShape LeaderShape { get ; }` |